src/test/resources/datasetSuccessPayload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dataset="http://www.yuelchen.com/soap/dataset">
   <soapenv:Header/>
   <soapenv:Body>
      <dataset:DatasetRequest>
         <dataset:datasetName>DSET90000001</dataset:datasetName>
	 <dataset:datasetDescription>This is a test dataset.</dataset:datasetDescription>
	 <dataset:datasetFieldsCount>3</dataset:datasetFieldsCount>
      </dataset:DatasetRequest>
   </soapenv:Body>
</soapenv:Envelope>
